ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM066/Periph_Driver/src/tmpm066_uart.c

/**
 *******************************************************************************
 * @file    tmpm066_uart.c
 * @brief   This file provides API functions for UART driver.
 * @version V2.0.2.1
 * @date    2015/09/10
 *
 * (C)Copyright TOSHIBA ELECTRONIC DEVICES & STORAGE CORPORATION 2017 All rights reserved
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "tmpm066_uart.h"

#if defined(__TMPM066_UART_H)
/** @addtogroup TX00_Periph_Driver
  * @{
  */

/** @defgroup UART
  * @brief UART driver modules
  * @{
  */

/** @defgroup UART_Private_Defines
  * @{
  */
#define EN_SIOE_SET            ((uint32_t)0x00000001)
#define EN_SIOE_CLEAR          ((uint32_t)0xFFFFFFFE)
#define EN_BRCKSEL_MASK        ((uint32_t)0xFFFFFFFD)

#define CR_PARITY_MASK         ((uint32_t)0x0000779F)
#define CR_ERROR_MASK          ((uint32_t)0x0000001C)
#define CR_OERR_FLAG           ((uint8_t)0x10)
#define CR_PERR_FLAG           ((uint8_t)0x08)
#define CR_FERR_FLAG           ((uint8_t)0x04)
#define CR_IOC_MASK            ((uint32_t)0x000077FE)
#define CR_SCLKS_MASK          ((uint32_t)0x000077FD)
#define CR_TIDLE_MASK          ((uint32_t)0x000074FF)
#define CR_TXDEMP_MASK         ((uint32_t)0x000073FF)
#define CR_EHOLD_MASK          ((uint32_t)0x000007FF)

#define MOD0_CTSE_MASK         ((uint32_t)0x000000BF)
#define MOD0_RXE_CLEAR         ((uint32_t)0x000000DF)
#define MOD0_WU_SET            ((uint32_t)0x00000010)
#define MOD0_WU_CLEAR          ((uint32_t)0x000000EF)
#define MOD0_SM_MASK           ((uint32_t)0x000000F3)
#define MOD0_SC_MASK           ((uint32_t)0x000000FC)
#define MOD0_SC_BRG            ((uint32_t)0x00000001)

#define MOD1_I2SC_SET          ((uint32_t)0x00000080)
#define MOD1_I2SC_CLEAR        ((uint32_t)0x0000007F)
#define MOD1_TXE_CLEAR         ((uint32_t)0x000000EF)
#define MOD1_CLEAR             ((uint32_t)0x000000FE)
#define MOD1_FDPX_CLEAR        ((uint32_t)0x0000009F)
#define MOD1_SINT_MASK         ((uint32_t)0x000000F1)

#define MOD2_BUF_MASK          ((uint32_t)0x000000C0)
#define MOD2_TBEMP_FLAG        ((uint8_t)0x80)
#define MOD2_RBFLL_FLAG        ((uint8_t)0x40)
#define MOD2_SBLEN_MASK        ((uint32_t)0x000000EF)
#define MOD2_DRCHG_MASK        ((uint32_t)0x000000F7)
#define MOD2_WBUF_SET          ((uint32_t)0x00000004)
#define MOD2_WBUF_MASK         ((uint32_t)0x000000FB)
#define MOD2_SWRST_MASK        ((uint32_t)0x000000FC)
#define MOD2_SWRST_CMD1        ((uint32_t)0x00000002)
#define MOD2_SWRST_CMD2        ((uint32_t)0x00000001)

#define BRCR_BRADDE_SET        ((uint32_t)0x00000040)
#define BRCR_BRCK_MASK         ((uint32_t)0x000000CF)
#define BRCR_BRS_MASK          ((uint32_t)0x000000F0)
#define BRCR_CLEAR             ((uint32_t)0x0000007F)

#define BRADD_BRK_MASK         ((uint32_t)0x00000000)

#define FCNF_BIT567_CLEAR      ((uint32_t)0x0000001F)
#define FCNF_RFST_CLEAR        ((uint32_t)0x000000EF)
#define FCNF_TFIE_SET          ((uint32_t)0x00000008)
#define FCNF_TFIE_CLEAR        ((uint32_t)0x00000017)
#define FCNF_RFIE_SET          ((uint32_t)0x00000004)
#define FCNF_RFIE_CLEAR        ((uint32_t)0x0000001B)
#define FCNF_RXTXCNT_SET       ((uint32_t)0x00000002)
#define FCNF_RXTXCNT_CLEAR     ((uint32_t)0x0000001D)
#define FCNF_CNFG_SET          ((uint32_t)0x00000001)
#define FCNF_CNFG_CLEAR        ((uint32_t)0x0000001E)

#define RFC_4B_RIL_CLEAR       ((uint32_t)0x000000FC)
#define TFC_4B_TIL_CLEAR       ((uint32_t)0x000001FC)
#define RFC_RFIS_CLEAR         ((uint32_t)0x000000BF)
#define TFC_TFIS_CLEAR         ((uint32_t)0x000001BF)
#define TRFC_TRFCS_SET         ((uint32_t)0x00000080)
#define TFC_TBCLR_SET          ((uint32_t)0x00000100)

#define TRXST_TUR_ROR_MASK     ((uint32_t)0x00000080)
#define TRXST_4B_TRLVL_MASK    ((uint32_t)0x00000007)

#define DMA_EN0_SET              ((uint32_t)0x00000001)
#define DMA_EN0_CLEAR            ((uint32_t)0x00000002)

#define DMA_EN1_SET              ((uint32_t)0x00000002)
#define DMA_EN1_CLEAR            ((uint32_t)0x00000001)

/** @} */
/* End of group UART_Private_Defines */

/** @defgroup UART_Private_FunctionPrototypes
  * @{
  */

/** @} */
/* End of group UART_Private_FunctionPrototypes */

/** @defgroup UART_Private_Functions
  * @{
  */

/** @} */
/* End of group UART_Private_Functions */

/** @defgroup UART_Exported_Functions
  * @{
  */

/**
  * @brief  Enable the specified UART channel.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1.
  * @retval None
  */
void UART_Enable(TSB_SC_TypeDef *UARTx)
{
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    /* Set SCxEN<SIOE> to enable UARTx */
    UARTx->EN |= EN_SIOE_SET;
}

/**
  * @brief  Disable the specified UART channel.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1.
  * @retval None
  */
void UART_Disable(TSB_SC_TypeDef *UARTx)
{
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    /* Clear SCxEN<SIOE> to disable UARTx */
    UARTx->EN &= EN_SIOE_CLEAR;
}

/**
  * @brief  Indicate whether the transfer buffer is full or not.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1.
  * @param  Direction: Select the direction of transfer.
  *   This parameter can be UART_RX or UART_TX.
  * @retval The transfer buffer status.
  *   The value returned can be one of the followings:
  *   BUSY or DONE.
  */
WorkState UART_GetBufState(TSB_SC_TypeDef *UARTx, uint32_t Direction)
{
    uint8_t tmp = 0U;
    WorkState retval = BUSY;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UART_TRX(Direction));

    tmp = ((uint8_t)(UARTx->MOD2 & MOD2_BUF_MASK));
    switch (Direction) {
        case UART_TX:
            if ((tmp & MOD2_TBEMP_FLAG) == MOD2_TBEMP_FLAG) {
                /* Return Tx buffer empty if the flag is set */
                retval = DONE;
            } else {
                /* Do nothing */
            }
            break;
        case UART_RX:
            if ((tmp & MOD2_RBFLL_FLAG) == MOD2_RBFLL_FLAG) {
                /* Return Rx buffer full if the flag is set */
                retval = DONE;
            } else {
                /* Do nothing */
            }
            break;
        default:                   /* Do nothing */
            break;
    }

    return retval;
}

/**
  * @brief  Reset the specified UART channel.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0,UART1.
  * @retval None
  */
void UART_SWReset(TSB_SC_TypeDef *UARTx)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

