ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM066/Periph_Driver/src/tmpm066_uart.c
    SIOx->BUF = (uint32_t) Data;
}

/**
  * @brief  Initialize the specified SIO channel.
  * @param  SIOx: Select the SIO channel.
  *   This parameter can be one of the following values:
  *   SIO0,SIO1.
  * @param  IOClkSel: Selecting clock.
  *   This parameter can be one of the following values:
  *   SIO_CLK_SCLKOUTPUT or SIO_CLK_SCLKINPUT.
  * @param  InitStruct: The structure containing basic SIO configuration.
  * @retval None
  * @note SIO_SetInputClock need to use before SIO_Init.
  */
void SIO_Init(TSB_SC_TypeDef *SIOx, uint32_t IOClkSel, SIO_InitTypeDef *InitStruct)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(InitStruct));
    assert_param(IS_SIO_PERIPH(SIOx));
    assert_param(IS_SIO_CLK_SEL(IOClkSel));
    assert_param(IS_SIO_SCLKS_TRXD(InitStruct->InputClkEdge));
    assert_param(IS_SIO_TIDLE_LEVEL(InitStruct->TIDLE));
    assert_param(IS_SIO_TRANSFER_MODE(InitStruct->TransferMode));
    assert_param(IS_SIO_TRANS_DIR(InitStruct->TransferDir));
    assert_param(IS_SIO_MODE(InitStruct->Mode));
    assert_param(IS_SIO_WBUF_SET(InitStruct->DoubleBuffer));
    if (IOClkSel == SIO_CLK_SCLKINPUT) {
        /* Only used for SCLK pin input mode */
        assert_param(IS_SIO_TXDEMP_LEVEL(InitStruct->TXDEMP));
        assert_param(IS_SIO_EHOLD_TIME(InitStruct->EHOLDTime));
    } else {
        /* Only used for baud rate generator(SCLK pin output) mode */
        assert_param(IS_SIO_SINT_TIME(InitStruct->IntervalTime));
        assert_param(IS_SIO_BR_CLOCK(InitStruct->BaudRateClock));
        assert_param(IS_SIO_BR_DIVIDER(InitStruct->Divider));
    }

    /* Configure the transfer mode to I/O interface mode */
    tmp = SIOx->MOD0;
    tmp &= MOD0_SM_MASK;
    SIOx->MOD0 = tmp;

    /* Selecting the clock(SCLK input or output),input clock edge
       for I/O interface mode */
    tmp = SIOx->CR;
    tmp &= (CR_IOC_MASK & CR_SCLKS_MASK & CR_TIDLE_MASK);
    tmp |= (IOClkSel | InitStruct->InputClkEdge | InitStruct->TIDLE);

    /* Set status of TXDx pin when an under run error is occured
       and The last bit hold time of TXDx pin in SCLK input mode */
    if (IOClkSel == SIO_CLK_SCLKINPUT) {
        tmp &= (CR_TXDEMP_MASK & CR_EHOLD_MASK);
        tmp |= (InitStruct->TXDEMP | InitStruct->EHOLDTime);
    } else {
        /* Do nothing */
    }
    SIOx->CR = tmp;

    /* Set the transfer mode and interval time */
    tmp = SIOx->MOD1;
    tmp &= MOD1_FDPX_CLEAR;
    tmp |= InitStruct->TransferMode;
    /* Set the interval time that valid only for SCLK output mode and double
       buffer is enabled */
    if ((IOClkSel == SIO_CLK_SCLKOUTPUT) && (InitStruct->DoubleBuffer == SIO_WBUF_ENABLE)) {
        tmp &= MOD1_SINT_MASK;
        tmp |= InitStruct->IntervalTime;
    } else {
        /* Do nothing */
    }
    tmp &= MOD1_CLEAR;
    SIOx->MOD1 = tmp;

    /* Set the transfer direction and double buffer */
    tmp = SIOx->MOD2;
    tmp &= MOD2_DRCHG_MASK;
    tmp &= MOD2_WBUF_MASK;
    tmp |= (InitStruct->TransferDir | InitStruct->DoubleBuffer);
    SIOx->MOD2 = tmp;

    /* Select the input clock for baud rate generator and setting
       Division ratio "N"  */
    tmp = SIOx->BRCR;
    if (IOClkSel == SIO_CLK_SCLKOUTPUT) {
        tmp &= BRCR_BRCK_MASK;
        tmp &= BRCR_BRS_MASK;
        tmp |= (InitStruct->BaudRateClock | InitStruct->Divider);
    } else {
        /* Do nothing */
    }
    tmp &= BRCR_CLEAR;
    SIOx->BRCR = tmp;

    /* Enable or disable transmission or reception and both */
    tmp = SIOx->MOD1;
    switch (InitStruct->Mode) {
        case SIO_ENABLE_RX:
            SIOx->MOD0 |= InitStruct->Mode;
            tmp &= MOD1_TXE_CLEAR;
            break;
        case SIO_ENABLE_TX:
            tmp |= InitStruct->Mode;
            SIOx->MOD0 &= MOD0_RXE_CLEAR;
            break;
        default:
            SIOx->MOD0 |= SIO_ENABLE_RX;
            tmp |= SIO_ENABLE_TX;
            break;
    }
    tmp &= MOD1_CLEAR;
    SIOx->MOD1 = tmp;
}

/** @} */
/* End of group UART_Exported_Functions */

/** @} */
/* End of group UART */

/** @} */
/* End of group TX00_Periph_Driver */

#endif                          /* defined(__TMPM066_UART_H)) */
